Revit 2017 API
Railing.Create Method
Overload List
Name | Description
Create(Document, CurveLoop, ElementId, ElementId)
 Creates a new railing by specifying the railing path in the project document.
Create(Document, ElementId, ElementId, RailingPlacementPosition)
 Automatically creates new railings with the specified railing type on all sides of a stairs or ramp element.
See Also
Railing Class
Railing Members
Autodesk.Revit.DB.Architecture Namespace